excise_duty-master/srv/src/main/resources/AccountingDocumentProjectionSoapBody.xml

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope" xmlns:urn="urn:sap-com:document:sap:rfc:functions">
	<soapenv:Header />
	<soapenv:Body>
		<n0:ZED_ACC_DOC_POST_AND_COMMIT
			xmlns:n0="urn:sap-com:document:sap:rfc:functions">

			<ACCOUNTGL>
				<item>
					<ITEMNO_ACC>1</ITEMNO_ACC>
					<GL_ACCOUNT>{GL_ACCOUNT_1}</GL_ACCOUNT>
					<ITEM_TEXT>{POSTING_TEXT}</ITEM_TEXT>
					<LOG_PROC>1</LOG_PROC>
					<DOC_TYPE>AB</DOC_TYPE>
					<COMP_CODE>{COMPANY_CODE}</COMP_CODE>
					<PLANT>{PLANT}</PLANT>
					<PSTNG_DATE>{POSTING_DATE_FORMATTED}</PSTNG_DATE>
					<QUANTITY>{QUANTITY}</QUANTITY>
					<BASE_UOM>{UNIT_OF_MEASURE}</BASE_UOM>
					<BASE_UOM_ISO></BASE_UOM_ISO>
				</item>
				<item>
					<ITEMNO_ACC>2</ITEMNO_ACC>
					<GL_ACCOUNT>{GL_ACCOUNT_2}</GL_ACCOUNT>
					<ITEM_TEXT>{POSTING_TEXT}</ITEM_TEXT>
					<LOG_PROC>1</LOG_PROC>
					<DOC_TYPE>AB</DOC_TYPE>
					<COMP_CODE>{COMPANY_CODE}</COMP_CODE>
					<PLANT>{PLANT}</PLANT>
					<PSTNG_DATE>{POSTING_DATE_FORMATTED}</PSTNG_DATE>
					<QUANTITY>{QUANTITY}</QUANTITY>
					<BASE_UOM>{UNIT_OF_MEASURE}</BASE_UOM>
					<BASE_UOM_ISO></BASE_UOM_ISO>
				</item>
			</ACCOUNTGL>

			<CURRENCYAMOUNT>
				<item>
					<ITEMNO_ACC>1</ITEMNO_ACC>
					<CURR_TYPE>00</CURR_TYPE>
					<CURRENCY>{TAX_CURRENCY}</CURRENCY>
					<CURRENCY_ISO></CURRENCY_ISO>
					<AMT_DOCCUR>{TAX_AMOUNT_NEGATIVE}</AMT_DOCCUR>
				</item>
				<item>
					<ITEMNO_ACC>1</ITEMNO_ACC>
					<CURR_TYPE>10</CURR_TYPE>
					<CURRENCY>{TAX_CURRENCY}</CURRENCY>
					<CURRENCY_ISO></CURRENCY_ISO>
					<AMT_DOCCUR>{TAX_AMOUNT_NEGATIVE}</AMT_DOCCUR>
				</item>
				<item>
					<ITEMNO_ACC>2</ITEMNO_ACC>
					<CURR_TYPE>00</CURR_TYPE>
					<CURRENCY>{TAX_CURRENCY}</CURRENCY>
					<CURRENCY_ISO></CURRENCY_ISO>
					<AMT_DOCCUR>{TAX_AMOUNT_POSITIVE}</AMT_DOCCUR>
				</item>
				<item>
					<ITEMNO_ACC>2</ITEMNO_ACC>
					<CURR_TYPE>10</CURR_TYPE>
					<CURRENCY>{TAX_CURRENCY}</CURRENCY>
					<CURRENCY_ISO></CURRENCY_ISO>
					<AMT_DOCCUR>{TAX_AMOUNT_POSITIVE}</AMT_DOCCUR>
				</item>
			</CURRENCYAMOUNT>

			<DOCUMENTHEADER>
				<OBJ_TYPE>{REF_OBJECT_TYPE}</OBJ_TYPE>
				<OBJ_KEY>{REF_MATERIAL_NUMBER_AND_YEAR}</OBJ_KEY>
				<OBJ_SYS>{REF_OBJECT_SYSTEM}</OBJ_SYS>
				<BUS_ACT>{BUSINESS_ACTION}</BUS_ACT>
				<USERNAME>{USERNAME}</USERNAME>
				<HEADER_TXT>{POSTING_TEXT}</HEADER_TXT>
				<COMP_CODE>{COMPANY_CODE}</COMP_CODE>
				<DOC_DATE>{POSTING_DATE}</DOC_DATE>
				<PSTNG_DATE>{POSTING_DATE}</PSTNG_DATE>
				<TRANS_DATE>{POSTING_DATE}</TRANS_DATE>
				<DOC_TYPE>AB</DOC_TYPE>
				<REF_DOC_NO></REF_DOC_NO>
				<REF_DOC_NO_LONG></REF_DOC_NO_LONG>
			</DOCUMENTHEADER>

			<RETURN>
				<item>
					<TYPE></TYPE>
					<ID></ID>
					<NUMBER></NUMBER>
					<MESSAGE></MESSAGE>
					<LOG_NO></LOG_NO>
					<LOG_MSG_NO></LOG_MSG_NO>
					<MESSAGE_V1></MESSAGE_V1>
					<MESSAGE_V2></MESSAGE_V2>
					<MESSAGE_V3></MESSAGE_V3>
					<MESSAGE_V4></MESSAGE_V4>
					<PARAMETER></PARAMETER>
					<ROW></ROW>
					<FIELD></FIELD>
					<SYSTEM></SYSTEM>
				</item>
				<item>
					<TYPE></TYPE>
					<ID></ID>
					<NUMBER></NUMBER>
					<MESSAGE></MESSAGE>
					<LOG_NO></LOG_NO>
					<LOG_MSG_NO></LOG_MSG_NO>
					<MESSAGE_V1></MESSAGE_V1>
					<MESSAGE_V2></MESSAGE_V2>
					<MESSAGE_V3></MESSAGE_V3>
					<MESSAGE_V4></MESSAGE_V4>
					<PARAMETER></PARAMETER>
					<ROW></ROW>
					<FIELD></FIELD>
					<SYSTEM></SYSTEM>
				</item>
			</RETURN>

		</n0:ZED_ACC_DOC_POST_AND_COMMIT>
	</soapenv:Body>
</soapenv:Envelope>
